#include "Map.h"

void Map::show_map()
{

	system("cls");
	//cout << "世界地图:" << endl << endl;
	//cout << "                        __________						" << endl;
	//cout << "                       |          |					 " << endl;
	//cout << "                       |  信息楼  |					 " << endl;
	//cout << "                       |          |					 " << endl;
	//cout << "                       |__________|                                 " << endl;
	//cout << "                            |                                       " << endl;
	//cout << " ______________         ____|_____      __________       __________ " << endl;
	//cout << "|              |       |          |    |          |     |          |" << endl;
	//cout << "| 学生活动中心 |_______|  高裕路  |____|   食堂   |_____|    711   |" << endl;
	//cout << "|              |       |          |    |          |     |          | " << endl;
	//cout << "|______________|       |__________|    |__________|     |__________|" << endl;
	//cout << "        |                   |               |      " << endl;
	//cout << "   _____|_____          ____|______     ____|_____ " << endl;
	//cout << "   |         |         |           |   |          |" << endl;
	//cout << "   |   海边  |_________|   综合体  |   |   宿舍   |" << endl;
	//cout << "   |         |         |           |   |          |" << endl;
	//cout << "   |_________|         |___________|   |__________|" << endl;
	//cout << "                                            |      " << endl;
	//cout << "                                        ____|_____ " << endl;
	//cout << "                                       |          |" << endl;
	//cout << "                                       |   猪山   |" << endl;
	//cout << "                                       |          |" << endl;
	//cout << "                                       |__________|" << endl;
	cout << "世界地图:" << endl << endl;
	if (now_pos == 5)
	{
		cout << "                        __________						" << endl;
		cout << "                       |          |					 " << endl;
		cout << "                       |  ";
		cout << "\x1b[36m" << "信息楼";
		cout << "\x1b[37m" << "  | " << endl;
		cout << "                       |          |					 " << endl;
		cout << "                       |__________|                                 " << endl;
		cout << "                            |                                       " << endl;
		cout << " ______________         ____|_____      __________       __________ " << endl;

	}
	if (now_pos != 5)
	{
		cout << "                        __________						" << endl;
		cout << "                       |          |					 " << endl;
		cout << "                       |  信息楼  |					 " << endl;
		cout << "                       |          |					 " << endl;
		cout << "                       |__________|                                 " << endl;
		cout << "                            |                                       " << endl;
		cout << " ______________         ____|_____      __________       __________ " << endl;
	}
	if (now_pos == 8)
	{
		cout << "|              |       |          |    |          |     |          |" << endl;

		cout << "|";
		cout << "\x1b[36m" << "	学生活动中心";
		cout << "\x1b[37m" << " | ";
		cout << "_______|  高裕路  |____|  食堂  |_____|  711  | " << endl;
		cout << "|              |       |          |    |          |     |          | " << endl;
		cout << "|______________|       |__________|    |__________|     |__________|" << endl;
	}
	if (now_pos == 4)
	{
		cout << "|              |       |          |    |          |     |          |" << endl;
		cout << "| 学生活动中心 |";
		cout << "_______|  ";
		cout << "\x1b[36m" << "高裕路 ";
		cout << "\x1b[37m" << " |";
		cout << "____|  食堂   |_____|    711   | " << endl;

		cout << "|              |       |          |    |          |     |          | " << endl;
		cout << "|______________|       |__________|    |__________|     |__________|" << endl;
	}
	if (now_pos == 2)
	{
		cout << "|              |       |          |    |          |     |          |" << endl;
		cout << "| 学生活动中心 |";
		cout << "_______|  高裕路  |";
		cout << "____|  ";
		cout << "\x1b[36m" << "食堂  ";
		cout << "\x1b[37m" << "  |";
		cout << "_____|   711    | " << endl;

		cout << "|              |       |          |    |          |     |          | " << endl;
		cout << "|______________|       |__________|    |__________|     |__________|" << endl;
	}
	if (now_pos == 3)
	{
		cout << "|              |       |          |    |          |     |          |" << endl;
		cout << "| 学生活动中心 |";
		cout << "_______|  高裕路  |";
		cout << "____|   食堂   |";
		cout << "_____| ";
		cout << "\x1b[36m" << "  711  ";
		cout << "\x1b[37m" << "  |" << endl;

		cout << "|              |       |          |    |          |     |          | " << endl;
		cout << "|______________|       |__________|    |__________|     |__________|" << endl;
	}
	if (now_pos != 8 && now_pos != 4 && now_pos != 2 && now_pos != 3)
	{
		cout << "|              |       |          |    |          |     |          |" << endl;
		cout << "| 学生活动中心 |_______|  高裕路  |____|   食堂   |_____|    711   |" << endl;
		cout << "|              |       |          |    |          |     |          | " << endl;
		cout << "|______________|       |__________|    |__________|     |__________|" << endl;
	}

	if (now_pos == 7)
	{
		cout << "        |                   |               |      " << endl;
		cout << "   _____|_____          ____|______     ____|_____ " << endl;
		cout << "   |         |         |           |   |          |" << endl;

		cout << "   |   ";
		cout << "\x1b[36m" << "海边 ";
		cout << "\x1b[37m" << " |";
		cout << "_________|  综合体   |";
		cout << "   |   宿舍   |" << endl;

		cout << "   |         |         |           |   |          |" << endl;
		cout << "   |_________|         |___________|   |__________|" << endl;
		cout << "                                            |      " << endl;
		cout << "                                        ____|_____ " << endl;
	}
	if (now_pos == 6)
	{
		cout << "        |                   |               |      " << endl;
		cout << "   _____|_____          ____|______     ____|_____ " << endl;
		cout << "   |         |         |           |   |          |" << endl;

		cout << "   |   海边  |";
		cout << "_________|  ";
		cout << "\x1b[36m" << "综合体 ";
		cout << "\x1b[37m" << "  |";
		cout << "   |   宿舍   |" << endl;

		cout << "   |         |         |           |   |          |" << endl;
		cout << "   |_________|         |___________|   |__________|" << endl;
		cout << "                                            |      " << endl;
		cout << "                                        ____|_____ " << endl;
	}
	if (now_pos == 0)
	{
		cout << "        |                   |               |      " << endl;
		cout << "   _____|_____          ____|______     ____|_____ " << endl;
		cout << "   |         |         |           |   |          |" << endl;

		cout << "   |   海边  |";
		cout << "_________|   综合体  |";
		cout << "   | ";
		cout << "\x1b[36m" << "  宿舍 ";
		cout << "\x1b[37m" << "  | " << endl;

		cout << "   |         |         |           |   |          |" << endl;
		cout << "   |_________|         |___________|   |__________|" << endl;
		cout << "                                            |      " << endl;
		cout << "                                        ____|_____ " << endl;
	}
	if (now_pos != 7 && now_pos != 6 && now_pos != 0)
	{
		cout << "        |                   |               |      " << endl;
		cout << "   _____|_____          ____|______     ____|_____ " << endl;
		cout << "   |         |         |           |   |          |" << endl;
		cout << "   |   海边  |_________|   综合体  |   |   宿舍   |" << endl;
		cout << "   |         |         |           |   |          |" << endl;
		cout << "   |_________|         |___________|   |__________|" << endl;
		cout << "                                            |      " << endl;
		cout << "                                        ____|_____ " << endl;
	}
	if (now_pos == 1)
	{
		cout << "                                       |          |" << endl;

		cout << "                                       |   ";
		cout << "\x1b[36m" << "猪山 ";
		cout << "\x1b[37m" << "  | " << endl;

		cout << "                                       |          |" << endl;
		cout << "                                       |__________|" << endl;
	}
	if (now_pos != 1)
	{
		cout << "                                       |          |" << endl;
		cout << "                                       |   猪山   |" << endl;
		cout << "                                       |          |" << endl;
		cout << "                                       |__________|" << endl;
	}
	cout << "您现在的位置为:";
	cout << "\x1b[36m" << mapName[now_pos] << endl << "\x1b[37m";


}
void Map::Position_show()
{
	cout << "你当前所属位置：";
	cout << "\x1b[36m" << mapName[now_pos] << endl << "\x1b[27m";
}
void Map::change_flag_end()
{
	flag_end_map = 1;
}

void Map::move()
{
	
	show_map();
	cout << "请输入移动的方向： north（n）， south（s）， east（e）， west（w）[0退出]" << endl;
	cout << "你的选择>>";
	string option;
	int flag = 0;
	int temp_flag = 0;
	//cout << now_pos << endl;
	while (cin >> option)
	{

		if (now_pos == 7 || now_pos == 4)
		{
			temp_flag = 1;
		}

		if (option == "0") break;
		if (option == "n" && move_mp[{x, y}].find("n") != string::npos && (position[x][y + 1] != "学生活动中心" || (position[x][y + 1] == "学生活动中心" && flag_end_map == 1)))  y += 1, flag = 1, now_pos = now_position_mp[{x, y}];
		if (option == "s" && move_mp[{x, y}].find("s") != string::npos && (position[x][y - 1] != "学生活动中心" || (position[x][y - 1] == "学生活动中心" && flag_end_map == 1)))  y -= 1, flag = 1, now_pos = now_position_mp[{x, y}];
		if (option == "w" && move_mp[{x, y}].find("w") != string::npos && (position[x - 1][y] != "学生活动中心" || (position[x - 1][y] == "学生活动中心" && flag_end_map == 1)))  x -= 1, flag = 1, now_pos = now_position_mp[{x, y}];
		if (option == "e" && move_mp[{x, y}].find("e") != string::npos && (position[x + 1][y] != "学生活动中心" || (position[x + 1][y] == "学生活动中心" && flag_end_map == 1)))  x += 1, flag = 1, now_pos = now_position_mp[{x, y}];
		if (flag == 1) break;
		else cout << "你所处的位置禁止往该方向移动！" << endl;
		cout << ">>>>";
		cout << position[x][y] << endl;
		if (position[x][y] == "学生活动中心" && temp_flag == 1)
		{
			string end_words[37] =
			{
				"约翰踏入学生活动中心，眼前的景象令他心头一凛。废弃的走廊弯曲前行，残破的玻璃窗在微风中发出低沉的呜咽声，曾经的大厅现在布满了碎片和废墟。",
				"厚重的尘土覆盖了地板，几乎抹平了过去的足迹。墙上的壁画已经剥落，露出了墙体的裸露，好像是这里被抛弃的记忆和岁月的痕迹。某些房间的门被撞破，残留的家具和设备散落在地板上，早已被岁月侵蚀成了一堆无用之物。",
				"学生活动中心的内部结构比从外部看起来要复杂得多，宛如一个阴暗的迷宫。",
				"突然，约翰手机的铃声响起，他迅速接起电话，电话的另一端传来陌生却又熟悉的声音。",
				"神秘人：约翰，你现在在学生活动中心对吧？",
				"约翰：你是谁？为什么知道我的名字？",
				"神秘人：我是谁并不重要，现在关键是你要听从我的指示，如果想要揭开西海岸的真相。",
				"约翰：我凭什么相信你？我怎么能把自己的命运交托给一个陌生人？",
				"神秘人：如果我告诉你我也是原神玩家呢？事实上，我是C语言大神，曾参与早期原神游戏的开发。",
				"约翰：好吧，我愿意相信你。",
				"神秘人：很好，约翰。现在请你顺着门口左边的走廊一直走到尽头，然后在下一个交叉路口向右转……",
				"约翰按照神秘人的指示，一步步来到了大厅。",
				"幽暗的角落散发出阴森的氛围，约翰可以感受到这里曾经发生的不可告人的秘密。实验室设备的残骸、破碎的监控器以及被遗弃的文件夹在阴影中若隐若现，仿佛是过去残留下的恐怖的痕迹。",
				"大厅的尽头，一扇半开的门引起了约翰的注意。他小心翼翼地走进去，眼前的景象令他不寒而栗。那是一个昔日的实验室，设备和试管摆放得凌乱不堪。墙上的标本架空无一物，唯独中央的台子上，一个破烂的笼子里，躺着一具奇怪的生物尸体，四肢变异，皮肤苍白，散发着诡异的气息。",
				"空气中仿佛还残留着曾经的氛围，而约翰现在仿佛走进了一个禁地，触摸到了不为人知的秘密。身临其境的感觉让他心中涌起一股不安的情绪，他明白，这里才是揭开西海岸真相的关键所在。",
				"神秘人：你终于到了目的地了，这里正是西海岸一切罪恶的根源。",
				"约翰：这到底是什么地方？",
				"神秘人：根据你的描述和我所知，我猜想这里曾经是美军的生物实验基地。一场实验事故导致了它被废弃，为了掩盖真相，这里可能遭受了核打击。而这个学生活动中心就是原爆点。",
				"约翰：这和图书管理员的猜测一致。",
				"神秘人：接下来你的任务是收集证据。",
				"约翰：那你会公之于众吗？你究竟是谁，你的目的是什么？",
				"神秘人：这么久了，你还没有猜到吗？你还记得是谁向你推荐玩原神的吗？",
				"约翰：你是——",
				"神秘人：没错，我就是你的中国留学生同学李华。此外，我还有一个秘密身份，我是特殊机关米哈游的成员。米哈游一直知道美国海洋大学的西海岸校区隐藏着秘密，我们一直想揭开真相。",
				"约翰：你们是那个开发原神的米哈游？",
				"李华：没错，原神实际上是专门为你开发的，约翰。",
				"约翰：你这是什么意思？",
				"李华：你被发配到西海岸，你探索学生活动中心，这一切都在我们的计划中。我入学美国海洋大学的目的就是为了调查西海岸，然而我被学校领导怀疑，不论我怎么挂科，都只能住在高档留学生宿舍。于是，我们只能利用这里的学生来达成目标。米哈游看中了品学兼优的你。为了完成任务，我们集结了全球的C语言大神，连夜开发了原神。我们利用原神引导你，成功引诱你进入西海岸。",
				"约翰：……",
				"李华：我今天有两个目的，一个是协助你，一个是向你道歉。对不起，约翰，我们米哈游擅自改变了你的人生轨迹。",
				"约翰：没关系，能玩到开放世界3A大作原神，我感到非常幸运。李华，我们是永远的好兄弟。或许这一切早已注定。",
				"李华：谢谢你，我们永远是好兄弟。",
				"笼子里的奇怪生物“尸体”突然苏醒，还没等约翰反应过来，那个“尸体”就挣脱了笼子，站在了实验室的中央。约翰有机会重新审视它，发现它的身上没有多少地球生物的特征。",
				"约翰：怎怎怎么回事？那个怪物突然苏醒了！",
				"李华：它可能是那次实验事故的元凶。",
				"约翰：我现在该怎么办，兄弟？",
				"李华：我只负责带路，剩下的就看你的造化了。"
			};
			system("cls");
			for (int i = 0; i < 37; i++)
			{
				cout << end_words[i] << endl;
				Sleep(500);
			}

		}
	}
}
int Map::get_now_pos() { return now_pos; }
void Map::setNowPos(int pos)
{
	now_pos = pos;
}
string Map::get_now_map_name() { return mapName[now_pos]; }
void Map::init_map()
{
	now_pos = 0; //当前位置
	x = 2;
	y = 1;
	cout << "你在宿舍醒来过来~" << "[等级-1，余额减半]" << endl;
	cout << "宿管阿姨：小伙子，我不知道你发生了什么，只看到昏倒的你和亮着原神的手机。" << endl;
	cout << "约翰：**说藏话了**" << endl;
}
void Map::map_judge(Leader& player)
{
	if (now_pos == 0 && player.judge_poor_statue())
	{
		cout << "宿舍阿姨：小伙子你这状态不行啊！需要休息一下吗？（120$）" << endl;
		cout << "1. YES 2.NO" << endl;
		cout << ">>>>";
		int option;
		int end_flag = 0;
		while (cin >> option)
		{
			switch (option)
			{
			case 1:
			{
				player.reply_statue(120);
				end_flag = 1;
				break;
			}
			case 2:
			{
				cout << "约翰：不了，谢谢！" << endl;
				end_flag = 1;
				break;
			}
			default:
			{
				cout << "选项无效！请检查！" << endl;
			}
			}

			if (end_flag) break;
			cout << "1. YES 2.NO" << endl;
		}
	}
}